app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "body") VALUES (?, ?, ?, ?)  [["created_at", "2020-11-13 11:03:55.746075"], ["updated_at", "2020-11-13 11:03:55.746075"], ["user_id", 1], ["body", "Hey baby"]]